{
  "Employment": [
    {
      "employerName": "Evoke Creative Ltd",
      "companyLogo": "company-logo/evoke-creative-ltd",
      "companyURL": "https://www.evokecreative.co.uk/",
      "roles": [
        {
          "title": "Senior Software Developer",
          "description": "Developing white-label software solutions for kiosks and digital signage using Vue 3, Tailwind CSS, and component-based architecture. Creating bespoke user interfaces in Figma translating designs into responsive, accessible applications. Building reusable component libraries for multi-tenant deployments across diverse client installations. Providing technical support for digital signage systems and ensuring cross-platform compatibility for touchscreen kiosk environments. Collaborating on design systems and maintaining consistent branding across white-label implementations.",
          "startDate": "2025-05-26",
          "endDate": null,
          "location": "Hybrid Working"
        }
      ]
    },
    {
      "employerName": "SailGP",
      "companyLogo": "company-logo/sailGP",
      "companyURL": "https://www.sailgp.com/",
      "roles": [
        {
          "title": "Web Developer / UI Sim Developer",
          "description": "Developed SailGP Hospitality Sim using Next.js and Babylon.js with hardware input integration. Modernized main site by migrating from React 13 to Next.js 14, implementing TypeScript components following Figma designs with focus on accessibility and core web vitals. Created Itotem project integrating Blender 3D assets for touchscreen displays, including hardware sourcing and texture optimization. Built and configured travel-ready sim PCs with custom OS setup and network permissions. Tech Stack: React, Next.js, TypeScript, Contentful CMS, SCSS, Babylon.js, Blender, Adobe Premiere, Figma.",
          "startDate": "2023-10-16",
          "endDate": "2025-04-04",
          "location": "Remote Working"
        }
      ]
    },
    {
      "employerName": "Age Partnership",
      "companyLogo": "company-logo/age-partnership",
      "companyURL": "https://www.agepartnership.co.uk/",
      "roles": [
        {
          "title": "Senior Front End Developer",
          "description": "Rebuilt main site using PHP Twig, SCSS, BEM, HTML, JavaScript and NodeJS with modern component architecture. Conducted comprehensive web vitals analysis using CrUX reports, PageSpeed Insights, Lighthouse, and Search Console to identify performance bottlenecks. Built optimized components factoring in Core Web Vitals metrics. Provided strategic recommendations for migration to Jamstack and cloud-optimized architectures to improve site performance and scalability.",
          "startDate": "2022-10-24",
          "endDate": "2023-09-29",
          "location": "Remote Working"
        }
      ]
    },
    {
      "employerName": "Appreciate Group",
      "companyLogo": "company-logo/park-group-plc-logo",
      "companyURL": "https://www.appreciategroup.co.uk/",
      "roles": [
        {
          "title": "Front End Developer UI/UX",
          "description": "Worked across multiple Java-built projects including getpark.co.uk, highstreetvouchers.com, and love2shop.com with iOS/Android apps. Executed complete UI overhaul of Park Christmas Savings, modernizing from Bootstrap 2.3 to 4.6 and removing legacy jQuery/CSS. Optimized web vitals across all properties and updated Ionic/Cordova mobile apps. Conducted code reviews, analyzed wireframes in Figma, and provided technical guidance for CI/CD pipelines and cloud image hosting. Scoped Jamstack migration strategy while maintaining WordPress sites and MySQL databases. Implemented A/B testing via Google Optimize with focus on accessibility and customer-centric UX design.",
          "startDate": "2020-04-06",
          "endDate": "2022-10-07",
          "location": "Remote Working"
        }
      ]
    },
    {
      "employerName": "Trelleborg",
      "companyLogo": "company-logo/trelleborg-logo",
      "companyURL": "https://www.trelleborg.com/en/marine-and-infrastructure",
      "roles": [
        {
          "title": "Software Engineer - Front End Development",
          "description": "Developed Ship Performance Manager (SPM2) and Fleet software using C# .NET, MVC, React, and Angular. Refactored CSS architecture to establish coding standards and restructured pages to optimize Bootstrap 4 usage, reducing unnecessary classes. Built responsive UI components with React, integrated external APIs for graphing and weather data, and ensured responsiveness across all breakpoints. Self-taught React and Angular 2(8) while providing UX insights for improved user journeys. Managed workflow via Jira tickets using Git, Jenkins, and Bitbucket pipelines.",
          "startDate": "2019-07-08",
          "endDate": "2020-03-06",
          "location": "Broughton, Flintshire UK"
        }
      ]
    },
    {
      "employerName": "D2i Systems Ltd",
      "companyLogo": "company-logo/d2i-alt-logo.jpg",
      "companyURL": "https://www.d2isystems.com",
      "roles": [
        {
          "title": "Software Developer",
          "description": "Full-stack development using VB.NET, ASP.NET, HTML5, CSS, and JavaScript with Git/TFS version control. Refactored CSS for Middle East clients implementing mobile responsiveness. Developed custom .NET software solutions in Visual Studio, managed SQL databases and stored procedures. Completed company rebrand including logo design, brand guidelines, and marketing collateral using Photoshop, Illustrator, and Premiere. Built mobile-responsive email templates and registration portals. Provided onsite event support including equipment installation, testing, and technical troubleshooting for proprietary event software.",
          "startDate": "2017-11-06",
          "endDate": "2019-06-27",
          "location": "Birkenhead, UK"
        }
      ]
    },
    {
      "employerName": "Destination2.co.uk",
      "companyLogo": "company-logo/D2-Logo",
      "companyURL": "https://www.destination2.co.uk",
      "roles": [
        {
          "title": "Junior Full Stack Developer",
          "description": "Full-stack development using Umbraco CMS, C# .NET, HTML5, CSS with BEM methodology, and JavaScript managed via Git/TFS. Redesigned navigation for HolidayGems and rebuilt Destination2.co.uk frontend with code reviews to eliminate CSS conflicts. Established CSS coding standards using BEM approach to reduce stylesheet bloat. Built responsive static pages with jQuery, custom Google Maps integration, and Owl Carousel API. Created SQL scripts for dynamic destination data, designed imagery in Paint.NET, and implemented MVC pages. Utilized CodePen for rapid prototyping and resolved cross-browser compatibility issues. Managed bug tracking and workflow through Sifter.",
          "startDate": "2017-01-06",
          "endDate": "2017-10-08",
          "location": "Ellesmere Port, UK"
        }
      ]
    },
    {
      "employerName": "Holidaygems.co.uk",
      "companyLogo": "company-logo/HolidayGems",
      "companyURL": "https://www.holidaygems.co.uk",
      "roles": [
        {
          "title": "Junior Full Stack Developer",
          "description": "Full-stack development on travel booking platform using Umbraco CMS, C# .NET, and responsive frontend technologies. Built and maintained pages across HolidayGems and Destination2 sites ensuring cross-device compatibility. Implemented BEM methodology for scalable CSS architecture and integrated third-party APIs for enhanced functionality. Developed custom features using jQuery, JavaScript, and Google Maps integration while managing version control through Git/TFS.",
          "startDate": "2017-01-06",
          "endDate": "2017-10-08",
          "location": "Ellesmere Port, UK"
        }
      ]
    },
    {
      "employerName": "Sofology",
      "companyLogo": "company-logo/sofology-logo",
      "companyURL": "https://www.sofology.com",
      "roles": [
        {
          "title": "Junior Front End Developer",
          "description": "Frontend development using Umbraco CMS, C# .NET, HTML5, SCSS, BEM methodology, JavaScript, and Angular managed via Git/TFS. Rebuilt and refactored 'About Us' page to BEM standards using Sass. Supported e-commerce team building UI for new e-commerce pages with ongoing refactoring. Self-taught Sass/SCSS and deepened understanding of OOCSS principles while developing with Inuit CSS framework. Managed workflow through Jira ticketing system.",
          "startDate": "2016-07-01",
          "endDate": "2016-12-30",
          "location": "Liverpool, UK"
        }
      ]
    },
    {
      "employerName": "Fleetsolve Ltd",
      "companyLogo": "company-logo/fleetsolve-logo",
      "companyURL": "https://www.fleetsolve.com/",
      "roles": [
        {
          "title": "Software Support Technician",
          "description": "Designed and developed bespoke web forms from scratch using HTML, CSS, JavaScript, Bootstrap, PHP, SQL, and Azure (available on GitHub). Provided IT support including laptop maintenance, hardware repairs (screen and keyboard replacements), Windows 10 installations, and printer maintenance. Created dynamic Excel documents using VBA and macros. Monitored KPIs and targets for Tesco's Zero Carbon Stores CHP units, generated daily power unit reports for clients, and planned weekly engineer job cards and work schedules.",
          "startDate": "2016-02-15",
          "endDate": "2016-06-28",
          "location": "Liverpool, UK"
        }
      ]
    },
    {
      "employerName": "Nviron",
      "companyLogo": "company-logo/nviron-logo",
      "companyURL": "https://www.nviron.co.uk/",
      "roles": [
        {
          "title": "Technical Support Engineer",
          "description": "Created bespoke client forms using InfoPath, Photoshop, and JavaScript, embedded in Formotus and SharePoint for cross-platform deployment (Android, iOS, Windows). Converted Excel forms into responsive InfoPath/SharePoint solutions. Performed thorough testing using workflows, live dev environments, and core methodologies (Scrum, black-box, regression). Worked with SharePoint Designer, Active Directory, and basic C#/.NET/MVC. Developed client training documentation and coordinated with client teams to meet project targets.",
          "startDate": "2015-06-01",
          "endDate": "2015-12-14",
          "location": "Liverpool, UK"
        }
      ]
    },
    {
      "employerName": "Broadstone Financial Solutions",
      "companyLogo": "company-logo/broadstone-logo",
      "companyURL": "https://www.broadstone.co.uk/csfs/",
      "roles": [
        {
          "title": "IT Support Analyst / Systems Developer",
          "description": "Built demonstration and quick-start websites for middleware navigation using HTML, CSS, Bootstrap, and JavaScript (available on GitHub). Developed bespoke client benefits sites using Staffcare CMS with HTML, CSS, XML, and JavaScript. Created VBA macros for payroll data analysis, pension data processing for providers, and auto-enrolment analytics. Produced training videos using Adobe Photoshop, Premiere, and screen capture software. Delivered client training on middleware usage both onsite and via TeamViewer for users ranging from non-technical to enterprise level. Provided first-line IT support for Microsoft Office, servers, and PCs, along with document creation across multiple platforms.",
          "startDate": "2014-01-01",
          "endDate": "2015-05-31",
          "location": "Liverpool, UK"
        }
      ]
    },
    {
      "employerName": "Sony Computer Entertainment",
      "companyLogo": "company-logo/ps_2",
      "companyURL": "https://www.playstationjobs.co.uk/working-at-SCEE.html",
      "roles": [
        {
          "title": "QA Tester",
          "description": "Quality assurance testing for PlayStation games using various methodologies including regression, level testing, code testing, test case creation, black-box, and white-box testing. Participated in early testing of PlayStation 4 hardware and software during development phase. Performed localization testing (English language) on companion apps and titles including Knack. Credited on BAFTA-winning Tearaway, Killzone HD, and Ratchet & Clank: Full Frontal Assault. Additional uncredited work on Killzone Shadow Fall, Killzone Mercenary, Beyond: Two Souls, Minecraft PS3, LittleBigPlanet Vita, Hustle Kings, Travel Bug, DriveClub, Wonderbook titles (Book of Spells, Walking with Dinosaurs), and PS Move games (Sorcery, Book of Potions).",
          "startDate": "2013-04-01",
          "endDate": "2013-12-31",
          "location": "Liverpool, UK"
        }
      ]
    },
    {
      "employerName": "Sony Computer Entertainment",
      "companyLogo": "company-logo/ps_2",
      "companyURL": "https://www.playstationjobs.co.uk/working-at-SCEE.html",
      "roles": [
        {
          "title": "QA Tester Night Shift",
          "description": "Summer university placement ensuring PlayStation games met Sony's compliance standards through comprehensive functionality testing using regression, level testing, code testing, test cases, black-box, and white-box methodologies. Contributed to early testing of PlayStation 4 hardware and system software during pre-launch development. Conducted localization testing for English language content. Contributed to quality assurance for multiple AAA titles across PS3, PS Vita, and PS Move platforms including major franchises like Killzone, Ratchet & Clank, and exclusive Sony titles.",
          "startDate": "2012-06-04",
          "endDate": "2012-09-15",
          "location": "Liverpool, UK"
        }
      ]
    }
  ]
}
